<p><a target="_blank" href="https://startupfactory.bg">Startup Factory</a> с
подкрепата на <a target="_blank" href="https://facebook.com/uni.ruse">Русенски университет "Ангел Кънчев"</a>
организира за първи път в Русе хакатон – тридневно събитие за хора с интереси в
областта на софтуерна разработка, онлайн предприемачество, информационни технологии
и иновативни продукти.

Целта на инициативата е да събере на едно място програмисти, дизайнери и предприемачи,
които заедно да формулират концепция за софтуерен продукт и да стартират работа по неговото разработване.
</p>

<p>Начална дата 29 май 2015 (петък) – финал на 31 май (неделя).</p>

<p>За всички участници ще има награди, които са осигурени от спонсорите на събитието.
Първите три проекта оценени най-високо ще бъдат допълнително стимулирани с изненади
от организаторите. Фондът с награди е на стойност над 2 000 лв.</p>

<p><a target="_blank" href="https://startupfactory.bg">Startup Factory</a> благодари
на всички спонсори и партньори, които направиха събитието възможно. Признание
заслужава фирма Komfo, която първа се отзова и като генерален спонсор и партньор
и направи организацията на хакатона успешна.</p>

<img src="./media/final.jpg" class="img-fluid" alt="RuseHack2015: Обща снимка на финала" />
