<?php $timeline = [
	'2015:05:29 18:47:00' => 'Ден 1: подготовка за откриването',
	'2015:05:29 19:10:00' => 'Ден 1: откриване',
	'2015:05:30 12:05:00' => 'Ден 1: работа + пица',
	'2015:05:31 13:10:00' => 'Ден 2: работа + пица',
	'2015:05:31 15:30:00' => 'Ден 3: подготовка за представяне',
	'2015:05:31 17:45:00' => 'Ден 3: представяне на проектите',
	'2015:05:31 19:30:35' => 'Ден 3: награждаване',
]; ?>

<p>Събитието се проведе три дни. В късният следобяд на 29 май 2015 беше откриването,
след което започна работата по проектите. На втория ден, 30 май 2015, работата
продължи през целия ден до късно вечерта. Последният ден от хакатона, 31 май 2015,
беше завършването на проектите, тяхното представяне пред журито, оценяването на
резултатите и раздаването на наградите.
</p>

<?php $last = ''; foreach ($timeline as $timestamp => $title)
{
	echo '<div class="col-12"><h3 class="mt-5 mb-2 text-center">', $title, '</h3></div>';

	foreach ($this->photos as $photo)
	{
		[$original, $preview, $datetime] = $photo;

		if ($datetime > $last && $datetime < $timestamp)
		{
			echo '<div class="col-4 text-center">',
				'<a class="btn mb-3 p-2 bg-secondary" target="_blank" href="', $original, '">',
				'<img style="border:0; height: 280px;" alt="#RuseHack2015: ', $datetime, '" src="', $preview, '" />',
				'</a>',  '</div>';

		}
	}

	$last = $timestamp;
}
